In [1]:
import sqlite3
connection = sqlite3.connect('C:/Users/timmy/Desktop/COD/cis 2532 - python/assignment 12/ch17/books.db')

In [2]:
import pandas as pd

In [3]:
pd.options.display.max_columns = 10
pd.read_sql('SELECT last FROM authors order by last desc',connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [4]:
pd.read_sql('SELECT title FROM titles order by title asc',connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [5]:
pd.read_sql('''SELECT titles.title, titles.copyright, titles.isbn 
            FROM titles 
            inner join author_ISBN on author_ISBN.isbn = titles.isbn
            inner join authors on authors.id = author_ISBN.id
            where authors.id = 1
            order by titles.title asc''',connection)

                              title copyright        isbn
0         Android 6 for Programmers      2016  0134289366
1            Android How to Program      2017  0134444302
2                  C How to Program      2016  0133976890
3                C++ How to Program      2017  0134448235
4     Internet & WWW How to Program      2012  0132151006
5     Intro to Python for CS and DS      2020  0135404673
6               Java How to Program      2018  0134743350
7  Visual Basic 2012 How to Program      2014  0133406954
8          Visual C# How to Program      2017  0134601548
9         Visual C++ How to Program      2008  0136151574

In [6]:
cursor = connection.cursor()
cursor = cursor.execute("""INSERT INTO authors (first, last)
                            VALUES ('Tim', 'Spagnoli')""")

In [7]:
cursor = cursor.execute("""INSERT INTO titles (isbn, title, edition, copyright)
                            VALUES ('0134998793', 'New BOOK!', '1', '2006')""")

In [8]:
cursor = cursor.execute(""" INSERT INTO author_ISBN (id, isbn) VALUES (6, '0134998793') """)

In [9]:
pd.read_sql('''SELECT titles.title, titles.copyright, titles.isbn 
            FROM titles 
            inner join author_ISBN on author_ISBN.isbn = titles.isbn
            inner join authors on authors.id = author_ISBN.id
            where authors.id = 6
            order by titles.title asc''',connection)

       title copyright        isbn
0  New BOOK!      2006  0134998793